results/routeA/initialization_check/A-Ra1e5-coarse/0/gh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1600
(
-0.0176056338028169
-0.0176056338028169
-0.0176056338028169
-0.0176056338028169
-0.0176056338028169
-0.0176056338028169
-0.0176056338028169
-0.01760563380281691
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.0176056338028169
-0.05281690140845071
-0.08802816901408451
-0.1232394366197183
-0.1584507042253521
-0.1936619718309859
-0.2288732394366197
-0.2640845070422535
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.0176056338028169
-0.05281690140845071
-0.08802816901408451
-0.1232394366197183
-0.1584507042253521
-0.1936619718309859
-0.2288732394366197
-0.2640845070422535
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-1.408450704225352
-1.408450704225352
-1.408450704225352
-1.408450704225352
-1.408450704225352
-1.408450704225352
-1.408450704225352
-1.408450704225352
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
