results/routeA/initialization_check/A-Ra1e5-coarse/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1600
(
-0.0176056338028169
-0.0176056338028169
-0.0176056338028169
-0.0176056338028169
-0.0176056338028169
-0.0176056338028169
-0.0176056338028169
-0.0176056338028169
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.01759683098591549
-0.05279049295774648
-0.08798415492957747
-0.1231778169014084
-0.1583714788732394
-0.1935651408450704
-0.2287588028169014
-0.2639524647887324
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.01761443661971831
-0.05284330985915493
-0.08807218309859155
-0.1233010563380282
-0.1585299295774648
-0.1937588028169014
-0.228987676056338
-0.2642165492957746
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform -1.408450704225352;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
