results/routeA/initialization_check/A-Ra1e5-coarse/constant/g
FoamFile
{
    format ascii;
    class uniformDimensionedVectorField;
    location "constant";
    object g;
}
dimensions [0 1 -2 0 0 0 0];
value (0 -14.084507042253521 0);
